sdaiDeleteInstance(Sdai_instS*)
\details
Deletes a specified instance.
\param instance [in] An instance to be deleted.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiEI_NEXS - Instance does not exist.
* sdaiSY_ERR - Underlying system error.
\code
auto door = sdaiCreateInstanceBN(model, "ifcdoor");
sdaiDeleteInstance(door);  // door becomes a broken link after this line
...